// 诗人信息
export const poetInfo = {
    name: '宗婉',
    places: 20,
    description: '唐代著名女诗人，游历多地'
}

// 城市坐标点数据
export const pointsData = [
    { name: '江苏常熟', value: [120.752481, 31.654376] },
    { name: '兴邑', value: [121.363998, 31.160271] }, // 使用了接近上海的坐标作为兴邑
    { name: '河北保定', value: [115.464806, 38.874043] },
    { name: '山西', value: [112.562398, 37.873532] }, // 添加山西坐标点
]

// 路线数据
export const routesData = [
    {
        name: '江苏常熟到兴邑路线',
        color: '#FF5722',
        data: [
            [{ coord: [120.752481, 31.654376] }, { coord: [121.363998, 31.160271] }]
        ]
    },
    {
        name: '兴邑到河北保定路线',
        color: '#2196F3',
        data: [
            [{ coord: [121.363998, 31.160271] }, { coord: [115.464806, 38.874043] }]
        ]
    },
    {
        name: '河北保定到山西路线',
        color: '#4CAF50',
        data: [
            [{ coord: [115.464806, 38.874043] }, { coord: [112.562398, 37.873532] }]
        ]
    },

] 